sterentev/atdf-device-asm-include/inc/AT90PWM2B.inc
; ----------	Register PSOC0 bits		------------------------
.equ	PSYNC0_MASK	= 0x30		;      - Synchronization Out for ADC Selection (2 bits)
.equ	PSYNC00		= 4		;          PSYNC0 BIT0 position
.equ	POEN0B		= 2		; 0x04 - PSCOUT01 Output Enable
.equ	POEN0A		= 0		; 0x01 - PSCOUT00 Output Enable

; ----------	Register PIM0 bits		------------------------
.equ	PSEIE0		= 5		; 0x20 - PSC 0 Synchro Error Interrupt Enable
.equ	PEVE0B		= 4		; 0x10 - External Event B Interrupt Enable
.equ	PEVE0A		= 3		; 0x08 - External Event A Interrupt Enable
.equ	PEOPE0		= 0		; 0x01 - End of Cycle Interrupt Enable

; ----------	Register PIFR0 bits		------------------------
.equ	POAC0B		= 7		; 0x80 - PSC 0 Output A Activity
.equ	POAC0A		= 6		; 0x40 - PSC 0 Output A Activity
.equ	PSEI0		= 5		; 0x20 - PSC 0 Synchro Error Interrupt
.equ	PEV0B		= 4		; 0x10 - External Event B Interrupt
.equ	PEV0A		= 3		; 0x08 - External Event A Interrupt
.equ	PRN0_MASK	= 0x06		;      - Ramp Number (2 bits)
.equ	PRN00		= 1		;          PRN0 BIT0 position
.equ	PEOP0		= 0		; 0x01 - End of PSC0 Interrupt

; ----------	Register PICR2 bits		------------------------
.equ	PCST2		= 15		; 0x8000 - PSC 2 Input Capture Software Trig
.equ	PICR2_MASK	= 0x0FFF	;      - PSC 2 Input Capture Bytes (12 bits)
.equ	PICR20		= 0		;          PICR2 BIT0 position

; ----------	Register PFRC2B bits		------------------------
.equ	PCAE2B		= 7		; 0x80 - PSC 2 Capture Enable Input Part B
.equ	PISEL2B		= 6		; 0x40 - PSC 2 Input Select for Part B
.equ	PELEV2B		= 5		; 0x20 - PSC 2 Edge Level Selector on Input Part B
.equ	PFLTE2B		= 4		; 0x10 - PSC 2 Filter Enable on Input Part B
.equ	PRFM2B_MASK	= 0x0F		;      - PSC 2 Retrigger and Fault Mode for Part B (4 bits)
.equ	PRFM2B0		= 0		;          PRFM2B BIT0 position

; ----------	Register PFRC2A bits		------------------------
.equ	PCAE2A		= 7		; 0x80 - PSC 2 Capture Enable Input Part A
.equ	PISEL2A		= 6		; 0x40 - PSC 2 Input Select for Part A
.equ	PELEV2A		= 5		; 0x20 - PSC 2 Edge Level Selector on Input Part A
.equ	PFLTE2A		= 4		; 0x10 - PSC 2 Filter Enable on Input Part A
.equ	PRFM2A_MASK	= 0x0F		;      - PSC 2 Retrigger and Fault Mode for Part A (4 bits)
.equ	PRFM2A0		= 0		;          PRFM2A BIT0 position

; ----------	Register PCTL2 bits		------------------------
.equ	PPRE2_MASK	= 0xC0		;      - PSC 2 Prescaler Selects (2 bits)
.equ	PPRE20		= 6		;          PPRE2 BIT0 position
.equ	PBFM2		= 5		; 0x20 - Balance Flank Width Modulation
.equ	PAOC2B		= 4		; 0x10 - PSC 2 Asynchronous Output Control B
.equ	PAOC2A		= 3		; 0x08 - PSC 2 Asynchronous Output Control A
.equ	PARUN2		= 2		; 0x04 - PSC2 Auto Run
.equ	PCCYC2		= 1		; 0x02 - PSC2 Complete Cycle
.equ	PRUN2		= 0		; 0x01 - PSC 2 Run

; ----------	Register PCNF2 bits		------------------------
.equ	PFIFTY2		= 7		; 0x80 - PSC 2 Fifty
.equ	PALOCK2		= 6		; 0x40 - PSC 2 Autolock
.equ	PLOCK2		= 5		; 0x20 - PSC 2 Lock
.equ	PMODE2_MASK	= 0x18		;      - PSC 2 Mode (2 bits)
.equ	PMODE20		= 3		;          PMODE2 BIT0 position
.equ	POP2		= 2		; 0x04 - PSC 2 Output Polarity
.equ	PCLKSEL2	= 1		; 0x02 - PSC 2 Input Clock Select
.equ	POME2		= 0		; 0x01 - PSC 2 Output Matrix Enable

; ----------	Register OCR2RB bits		------------------------
.equ	OCR2RB_MASK	= 0xFFFF	;      - Output Compare RB (16 bits)
.equ	OCR2RB0		= 0		;          OCR2RB BIT0 position

; ----------	Register OCR2SB bits		------------------------
.equ	OCR2SB_MASK	= 0x0FFF	;      - Output Compare SB (12 bits)
.equ	OCR2SB0		= 0		;          OCR2SB BIT0 position

; ----------	Register OCR2RA bits		------------------------
.equ	OCR2RA_MASK	= 0x0FFF	;      - Output Compare RA (12 bits)
.equ	OCR2RA0		= 0		;          OCR2RA BIT0 position

; ----------	Register OCR2SA bits		------------------------
.equ	OCR2SA_MASK	= 0x0FFF	;      - Output Compare SA (12 bits)
.equ	OCR2SA0		= 0		;          OCR2SA BIT0 position

; ----------	Register POM2 bits		------------------------
.equ	POMV2B_MASK	= 0xF0		;      - Output Matrix Output B Ramps (4 bits)
.equ	POMV2B0		= 4		;          POMV2B BIT0 position
.equ	POMV2A_MASK	= 0x0F		;      - Output Matrix Output A Ramps (4 bits)
.equ	POMV2A0		= 0		;          POMV2A BIT0 position

; ----------	Register PSOC2 bits		------------------------
.equ	POS2_MASK	= 0xC0		;      - PSC 2 Output 23 Select (2 bits)
.equ	POS20		= 6		;          POS2 BIT0 position
.equ	PSYNC2__MASK	= 0x30		;      - Synchronization Out for ADC Selection (2 bits)
.equ	PSYNC2_0	= 4		;          PSYNC2_ BIT0 position
.equ	POEN2D		= 3		; 0x08 - PSCOUT23 Output Enable
.equ	POEN2B		= 2		; 0x04 - PSCOUT21 Output Enable
.equ	POEN2C		= 1		; 0x02 - PSCOUT22 Output Enable
.equ	POEN2A		= 0		; 0x01 - PSCOUT20 Output Enable

; ----------	Register PIM2 bits		------------------------
.equ	PSEIE2		= 5		; 0x20 - PSC 2 Synchro Error Interrupt Enable
.equ	PEVE2B		= 4		; 0x10 - External Event B Interrupt Enable
.equ	PEVE2A		= 3		; 0x08 - External Event A Interrupt Enable
.equ	PEOPE2		= 0		; 0x01 - End of Cycle Interrupt Enable

; ----------	Register PIFR2 bits		------------------------
.equ	POAC2B		= 7		; 0x80 - PSC 2 Output A Activity
.equ	POAC2A		= 6		; 0x40 - PSC 2 Output A Activity
.equ	PSEI2		= 5		; 0x20 - PSC 2 Synchro Error Interrupt
.equ	PEV2B		= 4		; 0x10 - External Event B Interrupt
.equ	PEV2A		= 3		; 0x08 - External Event A Interrupt
.equ	PRN2_MASK	= 0x06		;      - Ramp Number (2 bits)
.equ	PRN20		= 1		;          PRN2 BIT0 position
.equ	PEOP2		= 0		; 0x01 - End of PSC2 Interrupt




; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  COMM_SCK_RATE_3BIT	:::: values
;			0b000		; fosc/4
;			0b001		; fosc/16
;			0b010		; fosc/64
;			0b011		; fosc/128
;			0b100		; fosc/2
;			0b101		; fosc/8
;			0b110		; fosc/32
;			0b111		; fosc/64



; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 32
.equ	INT_VECTORS_SIZE	= 0x40
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin, Power-on Reset, Brown-out Reset, Watchdog Reset and JTAG AVR Reset
;	1	PSC2_CAPT	; PSC2 Capture Event
;	2	PSC2_EC		; PSC2 End Cycle
;	3	PSC1_CAPT	; PSC1 Capture Event
;	4	PSC1_EC		; PSC1 End Cycle
;	5	PSC0_CAPT	; PSC0 Capture Event
;	6	PSC0_EC		; PSC0 End Cycle
;	7	ANALOG_COMP_0	; Analog Comparator 0
;	8	ANALOG_COMP_1	; Analog Comparator 1
;	9	ANALOG_COMP_2	; Analog Comparator 2
;	10	INT0		; External Interrupt Request 0
;	11	TIMER1_CAPT	; Timer/Counter1 Capture Event
;	12	TIMER1_COMPA	; Timer/Counter1 Compare Match A
;	13	TIMER1_COMPB	; Timer/Counter Compare Match B
;	14	RESERVED15
;	15	TIMER1_OVF	; Timer/Counter1 Overflow
;	16	TIMER0_COMPA	; Timer/Counter0 Compare Match A
;	17	TIMER0_OVF	; Timer/Counter0 Overflow
;	18	ADC		; ADC Conversion Complete
;	19	INT1		; External Interrupt Request 1
;	20	SPI_STC		; SPI Serial Transfer Complete
;	21	USART_RX	; USART, Rx Complete
;	22	USART_UDRE	; USART Data Register Empty
;	23	USART_TX	; USART, Tx Complete
;	24	INT2		; External Interrupt Request 2
;	25	WDT		; Watchdog Timeout Interrupt
;	26	EE_READY	; EEPROM Ready
;	27	TIMER0_COMPB	; Timer Counter 0 Compare Match B
;	28	INT3		; External Interrupt Request 3
;	29	RESERVED30
;	30	RESERVED31
;	31	SPM_READY	; Store Program Memory Read



