sterentev/atdf-device-asm-include/inc/AT90PWM2B.inc
; **********************************************************************
; ***************	ASM PROGRAM SKELETON	************************
; **********************************************************************
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.include "AT90PWM2B.inc"
;#	
;#	; FUSES EXTENDED byte (addr 0x02)
;#	.set	BOOTSZ		= 0x02	; Boot Flash size=512 words Boot address=$0E00
;#	.set	FUSES_EXTENDED	= 0xFF \
;#				  & ~(0 <<PSC2RB) \
;#				  & ~(0 <<PSC1RB) \
;#				  & ~(0 <<PSC0RB) \
;#				  & ~(0 <<PSCRV) \
;#				  &  (~BOOTSZ_MASK | BOOTSZ) \
;#				  & ~(0 <<BOOTRST)
;#	; FUSES HIGH byte (addr 0x01)
;#	.set	BODLEVEL	= 0x07	; Brown-out detection disabled
;#	.set	FUSES_HIGH	= 0xFF \
;#				  & ~(0 <<RSTDISBL) \
;#				  & ~(0 <<DWEN) \
;#				  & ~(1 <<SPIEN) \
;#				  & ~(0 <<WDTON) \
;#				  & ~(0 <<EESAVE) \
;#				  &  (~BODLEVEL_MASK | BODLEVEL)
;#	; FUSES LOW byte (addr 0x00)
;#	.set	SUT_CKSEL	= 0x22	; Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 65 ms
;#	.set	FUSES_LOW	= 0xFF \
;#				  & ~(1 <<CKDIV8) \
;#				  & ~(0 <<CKOUT) \
;#				  &  (~SUT_CKSEL_MASK | SUT_CKSEL)
;#	; LOCKBITS LOCKBIT byte (addr 0x00)
;#	.set	LB		= 0x03	; No memory lock features enabled
;#	.set	BLB0		= 0x0C	; No lock on SPM and LPM in Application Section
;#	.set	BLB1		= 0x30	; No lock on SPM and LPM in Boot Section
;#	.set	LOCKBITS_LOCKBIT= 0xFF \
;#				  &  (~LB_MASK | LB) \
;#				  &  (~BLB0_MASK | BLB0) \
;#				  &  (~BLB1_MASK | BLB1)
;#	.message "====================="
;#	.message "=====  Fuses  ======="
;#	.message "EXTENDED	", FUSES_EXTENDED
;#	.message "HIGH		", FUSES_HIGH
;#	.message "LOW		", FUSES_LOW
;#	.message "===== Lockbits ======"
;#	.message " LOCKBIT	", LOCKBITS_LOCKBIT
;#	.message "====================="
;#	
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	RESET		; RESET		 - External Pin, Power-on Reset, Brown-out Reset, Watchdog Reset and JTAG AVR Reset
;#		reti			; PSC2_CAPT	 - PSC2 Capture Event
;#		reti			; PSC2_EC	 - PSC2 End Cycle
;#		reti			; PSC1_CAPT	 - PSC1 Capture Event
;#		reti			; PSC1_EC	 - PSC1 End Cycle
;#		reti			; PSC0_CAPT	 - PSC0 Capture Event
;#		reti			; PSC0_EC	 - PSC0 End Cycle
;#		reti			; ANALOG_COMP_0	 - Analog Comparator 0
;#		reti			; ANALOG_COMP_1	 - Analog Comparator 1
;#		reti			; ANALOG_COMP_2	 - Analog Comparator 2
;#		rjmp	INT0_ISR	; INT0		 - External Interrupt Request 0
;#		reti			; TIMER1_CAPT	 - Timer/Counter1 Capture Event
;#		reti			; TIMER1_COMPA	 - Timer/Counter1 Compare Match A
;#		reti			; TIMER1_COMPB	 - Timer/Counter Compare Match B
;#		reti			; RESERVED15	 - 
;#		reti			; TIMER1_OVF	 - Timer/Counter1 Overflow
;#		reti			; TIMER0_COMPA	 - Timer/Counter0 Compare Match A
;#		reti			; TIMER0_OVF	 - Timer/Counter0 Overflow
;#		reti			; ADC		 - ADC Conversion Complete
;#		reti			; INT1		 - External Interrupt Request 1
;#		reti			; SPI_STC	 - SPI Serial Transfer Complete
;#		reti			; USART_RX	 - USART, Rx Complete
;#		reti			; USART_UDRE	 - USART Data Register Empty
;#		reti			; USART_TX	 - USART, Tx Complete
;#		reti			; INT2		 - External Interrupt Request 2
;#		reti			; WDT		 - Watchdog Timeout Interrupt
;#		rjmp	EE_READY_ISR	; EE_READY	 - EEPROM Ready
;#		reti			; TIMER0_COMPB	 - Timer Counter 0 Compare Match B
;#		reti			; INT3		 - External Interrupt Request 3
;#		reti			; RESERVED30	 - 
;#		reti			; RESERVED31	 - 
;#		reti			; SPM_READY	 - Store Program Memory Read
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	RESET:
;#		cli
;#		ldi	r16, high(ADDR_IRAM_END)
;#		out	SP+1, r16
;#		ldi	r16, low(ADDR_IRAM_END)
;#		out	SP, r16
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _AT90PWM2B_INC_ */

; ************************ END OF FILE *********************************

